def poker1(a):
    c =a/(a+2)
    phi = 2*a/(a+2)**2
    integral1 =2*(phi+1-c)
    integral2 = 20-802/21 - 20*c**2 +802*c/21
    K = -1+integral1-2*phi+integral2

    print("Значение коэффициента с равно " + str(c))
    print("Значение игры K равно " + str(K))
    return K

poker1(19)

def poker2(a,b):
    c = ((a+1)*(a+2)*b+a*(2*a+b+2)**2)/((a+2)*((a+1)*b+(2*a+b+2)**2))
    e = 1-((4*(a+1)*(2*a+b+2))/((a+2)*((a+1)*b+(2*a+b+2)**2)))
    d = 1-((2*(a+1)*(2*a+b+2))/((a+2)*((a+1)*b+(2*a+b+2)**2)))
    m1 = 2*a*(2*a+b+2)**2/((a+2)**2*((a+1)*b+(2*a+b+2)**2))
    m2 = 2*(a+1)*b/((a+2)*((a+1)*b+(2*a+b+2)**2))
    c1 = 3354682/86961
    c2 = 168404/2121
    int1 = 20*e**2-c1*e-20*c**2+c1*c
    int2 = 20*d**2-c1*d-20*e**2+c1*e
    int3 = 41-c2-41*d**2+c2*d
    K = -1 + 2*(m1+e-c)+2*(1-e)-2*m1+int1+int2+int3

    print("Значение коэффициента с равно " + str(c))
    print("Значение коэффициента e равно " + str(e))
    print("Значение коэффициента d равно " + str(d))
    print("Значение коэффициента m1 равно " + str(m1))
    print("Значение коэффициента m2 равно " + str(m2))
    print("Значение игры K равно " + str(K))
    return K

poker2(19,21)